onec-mid-base-11/src/Documents/ВИК_Доставка/ВИК_Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВИК_Доставка</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ВИК_Доставка/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда    
	
#Область ПрограммныйИнтерфейс
	
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт		
	//  Анкета клиента
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АнкетаКлиента";
	КомандаПечати.Представление = НСтр("ru = 'АнкетаКлиента'");
	КомандаПечати.Порядок = 5;
	
	// Транспортная накладная
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТранспортнаяНакладная";
	КомандаПечати.Представление = НСтр("ru = 'ТранспортнаяНакладная'");
	КомандаПечати.Порядок = 10;
		
	// Комплект документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АнкетаКлиента,ТранспортнаяНакладная";
	КомандаПечати.Представление = НСтр("ru = 'Комплект документов'");
	КомандаПечати.Порядок = 75;
	
КонецПроцедуры 

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АнкетаКлиента");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАнкетыКлиента(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'АнкетаКлиента'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ВИК_Доставка.ПФ_MXL_АнкетаКлиента";
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ТранспортнаяНакладная");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьТранспортнойНакладной(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'ТранспортнаяНакладная'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ВИК_Доставка.ПФ_MXL_ТранспортнаяНакладная";
	КонецЕсли;
			
КонецПроцедуры
 
#КонецОбласти  

#Область СлужебныеПроцедурыИФункции   

Функция ПечатьАнкетыКлиента(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВИК_Доставка.ПФ_MXL_АнкетаКлиента");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВИК_Доставка.Ссылка КАК Ссылка,
	|	ВИК_Доставка.Номер КАК Номер,
	|	ВИК_Доставка.Дата КАК Дата
	|ИЗ
	|	Документ.ВИК_Доставка КАК ВИК_Доставка
	|ГДЕ
	|	ВИК_Доставка.Ссылка В(&МассивОбъектов)";  
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов); 
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	ПервыйДокумент = Истина;  
	
	Пока Выборка.Следующий() Цикл 
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь; 
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ПараметрыОбласти = Новый Структура;
		ПараметрыОбласти.Вставить("Дата", Формат(Выборка.Дата,  "ДЛФ=DD"));      
		ПараметрыОбласти.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер));
		
		ОбластьШапка.Параметры.Заполнить(ПараметрыОбласти);
		
		ТабличныйДокумент.Вывести(ОбластьШапка); 
		
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода("https://habr.com/ru/", 2, 120);
				
		Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось сформировать QR-код.
			|Технические подробности см. в журнале регистрации.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе
			КартинкаQRКода = Новый Картинка(ДанныеQRКода);
			ОбластьШапка.Рисунки.СсылкаНаДокументДоставки.Картинка = КартинкаQRКода;
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);	
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент; 
	
КонецФункции

Функция ПечатьТранспортнойНакладной(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВИК_Доставка.ПФ_MXL_ТранспортнаяНакладная");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");      
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВИК_Доставка.Ссылка КАК Ссылка,
	               |	ВИК_Доставка.Номер КАК Номер,
	               |	ВИК_Доставка.Дата КАК Дата,
	               |	ВИК_Доставка.Организация КАК Организация,
	               |	ВИК_Доставка.Контрагент КАК Контрагент,
	               |	ВИК_Доставка.Товары.(
	               |		НомерСтроки КАК Номер,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество
	               |	) КАК Товары
	               |ИЗ
	               |	Документ.ВИК_Доставка КАК ВИК_Доставка
	               |ГДЕ
	               |	ВИК_Доставка.Ссылка В(&МассивОбъектов)";  
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов); 
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	ПервыйДокумент = Истина;  
	
	Пока Выборка.Следующий() Цикл 
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь; 
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ПараметрыОбласти = Новый Структура;
		ПараметрыОбласти.Вставить("Дата", Формат(Выборка.Дата,  "ДЛФ=DD"));      
		ПараметрыОбласти.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер));
		ПараметрыОбласти.Вставить("Организация", Выборка.Организация); 
		ПараметрыОбласти.Вставить("Контрагент", Выборка.Контрагент); 
		
		ОбластьШапка.Параметры.Заполнить(ПараметрыОбласти);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);  
		
		ВыборкаСтроки = Выборка.Товары.Выбрать();  
		Пока ВыборкаСтроки.Следующий() Цикл
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);   
		КонецЦикла; 		
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода("https://habr.com/ru/", 2, 120);
		
		Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось сформировать QR-код.
			|Технические подробности см. в журнале регистрации.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе
			КартинкаQRКода = Новый Картинка(ДанныеQRКода);
			ОбластьШапка.Рисунки.СсылкаНаДокументДоставки.Картинка = КартинкаQRКода;
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);	
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент; 
	
КонецФункции


#КонецОбласти 
	
#КонецЕсли
